package a_variable;
/**doc주석
 * 변수기본
 * @author pc09
 * @since 2018.05.29
 * 이 아래를 설명해주는 주석
 */
public class VariableBasic {
	public static void main(String[] args){
//		 한줄 주석
//		ctrl+shift+c
		/*
		 * 여러줄 주석
		 */
		/*
		1. 변수란?
			단 하나의 값을 저장할 수 있는 공간이다.
			ex)
			2x + 3y = 10;
			int x = 2;
			int y = 2;
			변수선언  값
			
	  	2. 변수의 선언
			[변수타입] [변수명];
			int			x	;
			
			int x; //변수의 선언
			x= 10; //변수의 초기화
			
			int x = 10; //변수의 선언 및 초기화
			
			x= 60;
			
		3. 함수 method
			public static void main()
			//main 메소드 명()
			
		4. 명명규칙
			변수명, 메소드명, 클래스명의 이름을 짓는 데는 반드시 지켜야할 공통적인 규칙이 있다.
			1 대소문자를 구분하며 길이의 제한이 없다.
			2 예약어(key word, reserved word)는 사용할 수 없다.
			3 숫자로 시작할 수 없다.
			4 특수문자는 '_', '$' 이 두개만 사용할 수 있다.
			
		5. 프로그래머들 간의 암묵적인 약속(가독성 상향)
			1 클래스명은 첫 글자를 대문자로 한다.
				(변수와 메소드의 첫글자는 소문자로 한다.)
			2 여러단어로 이루어진 경우, 두번째 단어부터 첫 글자는 대문자로 쓴다.
			3 상수는 모두 대문자로 쓴다. 변하지 않는 값.
				(ex.MAX_VALUE)
			4 한글은 사용하면 안된다.
		 */
			
						
		 
		
	}

}
